#+TITLE Test: Missing overlay for some tiles; other paths for all #4

* Tiles
:PROPERTIES:
:ETL: tile
:END:

This file is a part of dungeon-mode.  It is not a part of GNU Emacs.
This softare is released under the GNU Public Licence version three
or, at your disgression, any newer version of the GNU Public
License.  For specific terms please see [[LICENSE]] at end-of-file.

| tile | overlay          |
| aaa  | <text x=".80" y="1.65" font-size="1">aaa</text> |

| tile | path          |
| aaa  | h3 v3 h-3 v-3 |

| tile | water                 |
| aaa  | m.75,.75 h1.5 v1.5 h-1.5 v-1.5 |


* Cells
:PROPERTIES:
:ETL: cell
:END:

| x | y | path |
| 1 | 1 | aaa  |

* Test

#+BEGIN_SRC emacs-lisp
  (let ((dm-map-files (list (buffer-file-name)))
        (dm-map-draw-other-props '(water))
        (dm-map-background '(nil))
	(dm-map-draw-attributes
	 '(path ((fill . "none")
		 (stroke . "green")
		 (stroke-width . "1"))

	   water ((fill . "none")
	 	  (stroke . "orange")
		  (stroke-width . "1")))))
    (dm-map-draw t)
    (prin1-to-string (list 'tiles dm-map-tiles 'level dm-map-level)))
#+END_SRC

#+RESULTS:
: (tiles #s(hash-table size 65 test equal rehash-size 1.5 rehash-threshold 0.8125 data (aaa (path ((h (3)) (v (3)) (h (-3)) (v (-3))) tag nil overlay ((text ((x . 0.8) (y . 1.65) (font-size . 1)) "aaa")) stairs nil water ((m (0.75 0.75)) (h (1.5)) (v (1.5)) (h (-1.5)) (v (-1.5))) beach nil neutronium nil decorations nil))) level #s(hash-table size 65 test equal rehash-size 1.5 rehash-threshold 0.8125 data ((1 . 1) (path (aaa)))))

* LICENSE

This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <https://www.gnu.org/licenses/>.
